// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
// Написать программу, которая на вход принимает число, на выход выдает его квадрат

// 4 -> 16
// -3 -> 9
// -7 -> 49

int a = Convert.ToInt32(Console.ReadLine());
int b = Convert.ToInt32(Console.ReadLine());

if (a*a==b)
{Console.WriteLine("True");} 
else
Console.WriteLine("false");
