// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

//напишите программу, которая на вход принимает число и выдает его квадрат (число, умноженное на само себя)

// Например:
// 4 -> 16;
// -3 -> 9;
// -7 -> 49

 Console.WriteLine("Введите число");
 string example = Console.ReadLine();
 int a = Convert.ToInt32(example);

Console.WriteLine("Вывод");
int result = a*a;

Console.WriteLine(result); 

